In [10]:
#pip install pandas sqlalchemy

### sample dataframe

In [11]:
# sample dataframe
import pandas as pd
import numpy as np

np.random.seed(0)
number_of_samples = 10
frame = pd.DataFrame({
    'feature1': np.random.random(number_of_samples),
    'feature2': np.random.random(number_of_samples),
    'class':    np.random.binomial(2, 0.1, size=number_of_samples),
    },columns=['feature1','feature2','class'])

frame.head()

   feature1  feature2  class
0  0.548814  0.791725      1
1  0.715189  0.528895      0
2  0.602763  0.568045      0
3  0.544883  0.925597      0
4  0.423655  0.071036      0

In [12]:
# form existing data/files

#import pandas as pd
#frame = pd.read_csv(r"E:\lmi2022\rain.csv")
#frame.head()

### Set connection to MySQL

In [13]:
# Set connection to MySQL
import sqlalchemy

database_username = 'ENTER USERNAME'             #     user='najmi'
database_password = 'ENTER USERNAME PASSWORD'    #     password='====='
database_ip       = 'ENTER DATABASE IP'          #     host="10.21.45.183"
database_name     = 'ENTER DATABASE NAME'        #     database="ADR"
tableName         = 'ENTER TABLE NAME'           #     "rainfall"
database_connection = sqlalchemy.create_engine('mysql+mysqlconnector://{0}:{1}@{2}/{3}'.
                                               format(database_username, database_password, 
                                                      database_ip, database_name))

In [14]:
#Listing all tables of the database

r_set=database_connection.execute("SHOW DATABASES");
for row in r_set:
    print(row)

(bytearray(b'ADR'),)
(bytearray(b'information_schema'),)
(bytearray(b'mysql'),)
(bytearray(b'performance_schema'),)
(bytearray(b'sys'),)

In [15]:
#Listing all tables of the database

r_set=database_connection.execute("SHOW TABLES");
for row in r_set:
    print(row)

(bytearray(b'employees'),)
(bytearray(b'geo_kawasanku'),)
(bytearray(b'testingtable'),)

### Import dataframe into MySQL

In [16]:
# Import dataframe into MySQL
 
frame.to_sql(con=database_connection, name=tableName, if_exists='replace')
print(f"Connection to the {database_ip} for user {database_username} created successfully.\nTable {tableName} uploded successfully.")

Connection to the 10.21.45.183 for user najmi created successfully.
Table rainfall3 uploded successfully.

### Read dataframe from MySQL to python

In [17]:
# Read dataframe from MySQL to python
 
df = pd.read_sql_query("SELECT * FROM rainfall3",
    database_connection)

In [18]:
df.head()

   index  feature1  feature2  class
0      0  0.548814  0.791725      1
1      1  0.715189  0.528895      0
2      2  0.602763  0.568045      0
3      3  0.544883  0.925597      0
4      4  0.423655  0.071036      0